In [ ]:
#                                                                ques - 1

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [14]:
df = pd.Series([4, 8, 15, 16, 23,42])
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
#                                                               ques - 2

In [23]:
new_var = [54,"vivek",78,"raja",98,54,"shanti",89,21,"shrey"]
print(pd.Series(new_var))

0        54
1     vivek
2        78
3      raja
4        98
5        54
6    shanti
7        89
8        21
9     shrey
dtype: object

In [ ]:
#                                                               ques - 3

In [21]:
df2 = {'Name':['Alice','Bob','Charlie'],'Age':[25,30,27],'Gender' : ['Female','Male','Female']}
dataFrame = pd.DataFrame(data = df2)
dataFrame

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

In [ ]:
#                                                               ques - 4

In [ ]:
""" DataFrame : A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
    the major difference between series or dataframe is that series is one dimensional like single column and Dataframe is two 
    dimensional with multiple rows and columns.
    
    In the above ques 2 or 3 , there is a series in ques 2 which consist a single column of data but in ques no 3 ,
    there is multiple column named as NAME,AGE,GENDER which consists multiple data in it. 
    therefore DataFrame is also known as spreadsheet. also we can say that Dataframe is collection of multiple series.
"""

In [ ]:
#                                                               ques - 5

In [ ]:
""" Some common features that we use to manipulate the data in pandas DataFrame are : 
1.  Remove Column (using drop function)
2.  Add new column (using assign function)
3.  Merge two DataFrame (using merge function)
4.  Remove row (using conditions)
5.  Add new Row 
6.  Append new data
and many more manuplating operation can be done.

we can use the Drop Function() to remove the column when we are done with the column and that is no longer being used.
"""

In [ ]:
#                                                                ques - 6

In [ ]:
""" compare to value , all three are mutable which means values of dataframe,series and panel can be changed at any point of time
    but compare to size , two of three are mutable only which is Dataframe and panel size can be changed at any point of time but 
    the size of series cannot be changed(immutable) one's formed.
"""

In [ ]:
#                                                                ques - 7

In [26]:
ser1 = pd.Series([4, 8, 15, 16, 23,42])
ser2 = pd.Series([54,11,78,43,90,54])
ser3 = pd.Series(['Ram','Shyam','Mohan','Radha'])
dataFrame2 = pd.DataFrame(data = [ser1,ser2,ser3])
dataFrame2

     0      1      2      3     4     5
0    4      8     15     16  23.0  42.0
1   54     11     78     43  90.0  54.0
2  Ram  Shyam  Mohan  Radha   NaN   NaN

In [ ]:
""" Here in ques no 7, there is 3 series named ser1,ser2,ser3. so the ques is to make a DataFrame from multiple series so
    As per question i have Attached all the three series by the names as a list of assed through the data parameter in the DataFrame
    function. And the output comes as a whole of data Frame like a spreadsheet.
"""